[
    {
        "genre": "(F) Classic",
        "description": "A book or author that’s stood the test of time and has continued to inspire meaningful discussion and thought across generations. As gruesome as it sounds, I argue that the author needs to be dead for a book of theirs to be considered a classic."
    },
    {
        "genre": "(F) Literary",
        "description": "Books deemed as having artistic qualities. Often subtle in theme and contain some kind of social/political/personal commentary on what it means to be human. Can contain other genre elements, but the author uses those elements not to be parts of that community, but to highlight an important theme in their work."
    },
    {
        "genre": "(F) General",
        "description": "These books offer fun, engaging stories in a contemporary setting. They’re more approachable than Literary Fiction, and contain none of the genre elements in other categories."
    },
    {
        "genre": "(F) Historical",
        "description": "Books that take place at least 30 years before the time the author writes them. Subcategories are often broken up by time frames."
    },
    {
        "genre": "(F) Romance",
        "description": "A book where the primary plot involves falling in love (of the romantic variety) and has a happy or emotionally satisfying ending."
    },
    {
        "genre": "(F) Mystery",
        "description": "Novels where the plot revolves around solving why something has happened or will happen."
    },
    {
        "genre": "(F) Action",
        "description": "High-stake novels with frequent scene changes, where the protagonist is constantly being put at risk."
    },
    {
        "genre": "(F) Fantasy",
        "description": "Novels set in either a completely fictional world, or set in a version of this world that includes magic."
    },
    {
        "genre": "(F) Sci-Fi",
        "description": "Books that imagine a current possibility’s impact in the future."
    },
    {
        "genre": "(F) Horror",
        "description": "A novel where supernatural elements create fear and terror, both within the novel and for the reader."
    },
    {
        "genre": "(NF) History",
        "description": "Books which examine past true events. These can be broad surveys of a specific country, region, and/or time period, or they can focus on a specific event or set of events. They’re often heavily researched and can utilize academic language or be highly narrative."
    },
    {
        "genre": "(NF) Biography",
        "description": "Relates the story of a person’s life."
    },
    {
        "genre": "(NF) Fine Arts",
        "description": "Books where the information is primarily concerned with the aesthetic vs the factual."
    },
    {
        "genre": "(NF) Humour",
        "description": "Books meant to illicit laughter."
    },
    {
        "genre": "(NF) Religion",
        "description": "Books which examine a specific religion, the history of religions, and/or the practice of worshiping a deity/deities. Includes holy books."
    },
    {
        "genre": "(NF) Folklore",
        "description": "Collections and studies of fairytales, legends, storytelling, and folklore."
    },
    {
        "genre": "(NF) Philosophy",
        "description": "Study of the nature of knowledge, existence, and being from an academic perspective."
    },
    {
        "genre": "(NF) New Age",
        "description": "Books that examine nontraditional spirituality or non-mainstream belief practices."
    },
    {
        "genre": "(NF) Health",
        "description": "Books that describe ways of staying healthy: how to prevent or fight a specific medical issues; nutritional ideas; alternative medicine; nursing textbooks; sex, etc."
    },
    {
        "genre": "(NF) Science",
        "description": "Books which explain physical or natural science concepts, including mathematics, technology, chemistry, biology, physics, engineering and more."
    },
    {
        "genre": "(NF) Social",
        "description": "Books that analyze societies and social relationships."
    },
    {
        "genre": "(NF) Psychology",
        "description": "Books that examine mental and emotional functions and well-being."
    },
    {
        "genre": "(NF) Education",
        "description": "Books that look at the education system, including teaching how-to guides, curriculum guides, lesson plan collections, homeschool guides, special education, and test prep."
    },
    {
        "genre": "(NF) Reference",
        "description": "Books which provide basic, objective information, like dictionaries, encyclopedias, and books of quotations."
    },
    {
        "genre": "(NF) Business",
        "description": "Books about managing and creating businesses, job skills and career advice, personal and business finance, investing, and how money works."
    },
    {
        "genre": "(NF) Communicate.",
        "description": "Books about the ways communication occurs, communicating in other languages, the best ways to communicate, and the technical aspects of types of communication."
    },
    {
        "genre": "(NF) Home",
        "description": "Books about designing, organizing, taking care of, decorating, and otherwise loving homes and gardens."
    },
    {
        "genre": "(NF) Animals",
        "description": "Books about taking care of and loving animals."
    },
    {
        "genre": "(NF) Leisure",
        "description": "Books about activities and hobbies done or consumed primarily for enjoyment."
    },
    {
        "genre": "(NF) Cooking",
        "description": "Collections of recipes and the history of food."
    },
    {
        "genre": "(NF) Crime",
        "description": "Books that tell the story of a specific crime or criminal, collect stories of various criminals, or tell of a historical crime."
    },
    {
        "genre": "Other",
        "description": "Book's genre is not in the list."
    }
]